<header class="text-black">
    <div class="header-container">
        <div class="d-flex align-items-center justify-content-between">
            <div class="d-flex align-items-center">
                <a href="/">
                    <svg xmlns="http://www.w3.org/2000/svg" width="82" height="40" fill="none" viewBox="0 0 82 40">
                        <path fill="#FFD43D" d="M73.365 19.71c0 2.904-2.241 5.31-5.27 5.31-3.03 0-5.228-2.406-5.228-5.31 0-2.905 2.199-5.312 5.228-5.312s5.27 2.407 5.27 5.311Z"></path>
                        <path fill="#FF0C81" d="M48.764 19.544c0 2.946-2.323 5.145-5.27 5.145-2.904 0-5.227-2.2-5.227-5.145 0-2.947 2.323-5.104 5.228-5.104 2.946 0 5.27 2.158 5.27 5.104Z"></path>
                        <path fill="#11EEFC" d="M20.074 25.02c3.029 0 5.27-2.406 5.27-5.31 0-2.905-2.241-5.312-5.27-5.312-3.03 0-5.228 2.407-5.228 5.311 0 2.905 2.199 5.312 5.228 5.312Z"></path>
                        <path fill="#171A26" tth
                            d="M68.095 30.54c-6.307 0-11.12-4.897-11.12-10.872 0-5.934 4.855-10.83 11.12-10.83 6.349 0 11.162 4.938 11.162 10.83 0 5.975-4.855 10.871-11.162 10.871Zm0-5.52c3.03 0 5.27-2.406 5.27-5.31 0-2.905-2.24-5.312-5.27-5.312-3.029 0-5.228 2.407-5.228 5.311 0 2.905 2.199 5.312 5.228 5.312ZM43.08 40c-4.813 0-8.506-2.116-10.373-5.934l4.896-2.655c.913 1.784 2.614 3.195 5.394 3.195 3.486 0 5.85-2.448 5.85-6.473v-.374c-1.12 1.411-3.111 2.49-6.016 2.49-5.768 0-10.373-4.481-10.373-10.581 0-5.934 4.813-10.788 11.12-10.788 6.431 0 11.162 4.605 11.162 10.788v8.299C54.74 35.27 49.76 40 43.08 40Zm.415-15.311c2.946 0 5.27-2.2 5.27-5.145 0-2.947-2.324-5.104-5.27-5.104-2.905 0-5.228 2.158-5.228 5.104s2.323 5.145 5.228 5.145ZM20.074 30.54c-6.307 0-11.12-4.897-11.12-10.872 0-5.934 4.854-10.83 11.12-10.83 6.348 0 11.162 4.938 11.162 10.83 0 5.975-4.855 10.871-11.162 10.871Zm0-5.52c3.029 0 5.27-2.406 5.27-5.31 0-2.905-2.241-5.312-5.27-5.312-3.03 0-5.228 2.407-5.228 5.311 0 2.905 2.199 5.312 5.228 5.312ZM0 0h5.892v30H0V0ZM82 6.5a2.5 2.5 0 1 1-5 0 2.5 2.5 0 0 1 5 0Z">
                        </path>
                    </svg>
                </a>
                <h1 class="mb-0 ml-2 heade-icon-hssh">#МыВместе</h1>
            </div>
            {{-- <form class="form-search">
                <input class="form-control mr-sm-2" type="search" placeholder="Найти доброе дело или организацию" aria-label="Поиск">
                <button type="button" name="button">
                    <svg xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18" fill="none">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M7.33366 14.0005C3.65176 14.0005 0.666992 11.0157 0.666992 7.33381C0.666992 3.65191 3.65176 0.667145 7.33366 0.667145C11.0156 0.667145 14.0003 3.65191 14.0003 7.33381C14.0003 8.8744 13.4778 10.2929 12.6002 11.4218L17.0896 15.9112L15.9111 17.0897L11.4217 12.6004C10.2928 13.4779 8.87425 14.0005 7.33366 14.0005ZM12.3337 7.33381C12.3337 10.0952 10.0951 12.3338 7.33366 12.3338C4.57224 12.3338 2.33366 10.0952 2.33366 7.33381C2.33366 4.57239 4.57224 2.33381 7.33366 2.33381C10.0951 2.33381 12.3337 4.57239 12.3337 7.33381Z"
                            fill="white" />
                    </svg>
                </button>
            </form> --}}
            <div class="d-flex align-items-center">
                @auth
                <span class="mr-2">{{ Auth::user()->name }}</span>
                <a href="{{ route('lk') }}" class="btn btn-primary mr-2">Личный кабинет</a>
                <form method="POST" action="{{ route('logout') }}">
                    @csrf
                    <button type="submit" class="btn btn-secondary">Выйти</button>
                </form>
                @else
                <button class="btn btn-login mr-2" onclick="window.location.href='{{ route('login') }}'">
                    <i class="fas fa-sign-in-alt"></i> Войти
                </button>
                <button class="btn btn-reg" onclick="window.location.href='{{ route('register') }}'">Зарегистрироваться</button>
                @endauth
            </div>
        </div>
    </div>
</header>
